# Convert json to CSV

In [5]:
import pandas as pd
data = pd.read_json ('sampleData.json',orient='index')
data.to_csv ('Sample.csv', index = None)

# Count the unique value present in each columns

In [10]:
df=pd.read_csv('Sample.csv') 
df.nunique()

items            8
k_user_id       10
redeemed_at    999
saleAmount       4
user_id        571
dtype: int64

In [13]:
df.describe()

          k_user_id  saleAmount       user_id
count    999.000000  999.000000    999.000000
mean    4144.559560   19.449449  19525.547548
std     1445.979676    4.476301   8480.339334
min     2155.000000    0.000000   1795.000000
25%     4052.000000   20.000000  10199.000000
50%     4052.000000   20.000000  24484.000000
75%     4052.000000   20.000000  26710.000000
max    23832.000000   50.000000  27338.000000

# Count the number of time each merchant get Visited

In [25]:
countdata=df['k_user_id'].value_counts()
print(countdata)

4052     524
5979     122
4059      95
2746      87
2155      76
2774      32
3680      32
8215      22
11044      8
23832      1
Name: k_user_id, dtype: int64

In [28]:
countdata.to_csv('Count_merchant.csv')